app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"
---
  def index
    @tasks = Task.all

INSERT INTO "tasks" ("title", "description", "created_at", "updated_at", "status") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", ";sdsd"], ["description", "sdsd"], ["created_at", "2021-03-06 14:48:09.000866"], ["updated_at", "2021-03-06 14:48:09.000866"], ["status", 0]]
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save

DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 2]]
---
  def destroy
    @task.destroy

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_task
    @task = Task.find(params[:id])